Autodesk.Revit.DB.IFC.IFCFileFormat
The IFC file format.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileFormat.IfcXMLZIP
IFC-XML file, zipped to IFC-ZIP format.

Autodesk.Revit.DB.IFC.IFCFileFormat.IfcZIP
IFC file, zipped to IFC-ZIP format.

Autodesk.Revit.DB.IFC.IFCFileFormat.IfcXML
IFC-XML format.

Autodesk.Revit.DB.IFC.IFCFileFormat.Ifc
IFC format.